_posts/2013-03-01-Determining-linear-independence-of-a-set-of-vectors.html
---
title: Determining linear independence of a set of vectors
date: 2013/03/01 16:44:46
updated: 2013/03/03 10:23:10
categories: Linear algebra, reaction engineering
permalink: http://jkitchin.github.com/blog/2013/03/01/Determining-linear-independence-of-a-set-of-vectors/index.html
---


<p>
 <a href="http://matlab.cheme.cmu.edu/2011/08/02/determining-linear-independence-of-a-set-of-vectors/" >Matlab post</a>
Occasionally we have a set of vectors and we need to determine whether the vectors are linearly independent of each other. This may be necessary to determine if the vectors form a basis, or to determine how many independent equations there are, or to determine how many independent reactions there are.
</p>

<p>
Reference: Kreysig, Advanced Engineering Mathematics, sec. 7.4
</p>

<p>
Matlab provides a rank command which gives you the number of singular values greater than some tolerance. The numpy.rank function, unfortunately, does not do that. It returns the number of dimensions in the array. We will just compute the rank from singular value decomposition.
</p>

<p>
The default tolerance used in Matlab is max(size(A))*eps(norm(A)). Let us break that down. eps(norm(A)) is the positive distance from abs(X) to the next larger in magnitude floating point number of the same precision as X. Basically, the smallest significant number. We multiply that by the size of A, and take the largest number. We have to use some judgment in what the tolerance is, and what &ldquo;zero&rdquo; means.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
v1 = [6, 0, 3, 1, 4, 2];
v2 = [0, -1, 2, 7, 0, 5];
v3 = [12, 3, 0, -19, 8, -11];

A = np.row_stack([v1, v2, v3])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">matlab definition</span>
eps = np.finfo(np.linalg.norm(A).dtype).eps
TOLERANCE = <span style="color: #8b0000;">max</span>(eps * np.array(A.shape))

U, s, V = np.linalg.svd(A)
<span style="color: #8b0000;">print</span> s
<span style="color: #8b0000;">print</span> np.sum(s &gt; TOLERANCE)

TOLERANCE = 1e-14
<span style="color: #8b0000;">print</span> np.sum(s &gt; TOLERANCE)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; [  2.75209239e+01   9.30584482e+00   1.42425400e-15]
3
&gt;&gt;&gt; &gt;&gt;&gt; 2
</pre>

<p>
You can see if you choose too small a TOLERANCE, nothing looks like zero. the result with TOLERANCE=1e-14 suggests the rows are not linearly independent. Let us show that one row can be expressed as a linear combination of the other rows. 
</p>

<p>
The number of rows is greater than the rank, so these vectors are not
independent. Let's demonstrate that one vector can be defined as a linear
combination of the other two vectors. Mathematically we represent this
as:
</p>

<p>
$x_1 \mathit{v1} + x_2 \mathit{v2} = v3%
</p>

<p>
or
</p>

<p>
\([x_1 x_2][v1; v2] = v3\)
</p>

<p>
This is not the usual linear algebra form of Ax = b. To get there, we
transpose each side of the equation to get:
</p>

<p>
[v1.T v2.T][x_1; x_2] = v3.T
</p>

<p>
which is the form Ax = b. We solve it in a least-squares sense.
</p>

<div class="org-src-container">

<pre class="src src-python">A = np.column_stack([v1, v2])
x = np.linalg.lstsq(A, v3)
<span style="color: #8b0000;">print</span> x[0]
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; [ 2. -3.]
</pre>

<p>
This shows that v3 = 2*v1 - 3*v2
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> another example</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;">#</span><span style="color: #ff0000; font-weight: bold;">Problem set 7.4 #17</span>
<span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

v1 = [0.2, 1.2, 5.3, 2.8, 1.6]
v2 = [4.3, 3.4, 0.9, 2.0, -4.3]

A = np.row_stack([v1, v2])
U, s, V = np.linalg.svd(A)
<span style="color: #8b0000;">print</span> s
</pre>
</div>

<pre class="example">
[ 7.57773162  5.99149259]
</pre>

<p>
You can tell by inspection the rank is 2 because there are no near-zero singular values. 
</p>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Near deficient rank</h2>
<div class="outline-text-2" id="text-2">
<p>
the rank command roughly works in the following way: the matrix is converted to a reduced row echelon form, and then the number of rows that are not all equal to zero are counted. Matlab uses a tolerance to determine what is equal to zero. If there is uncertainty in the numbers, you may have to define what zero is, e.g. if the absolute value of a number is less than 1e-5, you may consider that close enough to be zero. The default tolerance is usually very small, of order 1e-15. If we believe that any number less than 1e-5 is practically equivalent to zero, we can use that information to compute the rank like this.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

A = [[1, 2, 3],
     [0, 2, 3],
     [0, 0, 1e-6]]

U, s, V = np.linalg.svd(A)
<span style="color: #8b0000;">print</span> s
<span style="color: #8b0000;">print</span> np.sum(np.abs(s) &gt; 1e-15)
<span style="color: #8b0000;">print</span> np.sum(np.abs(s) &gt; 1e-5)
</pre>
</div>

<pre class="example">
[  5.14874857e+00   7.00277208e-01   5.54700196e-07]
3
2
</pre>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Application to independent chemical reactions.</h2>
<div class="outline-text-2" id="text-3">
<p>
reference: Exercise 2.4 in Chemical Reactor Analysis and Design Fundamentals by Rawlings and Ekerdt.
</p>

<p>
The following reactions are proposed in the hydrogenation of bromine:
</p>

<p>
Let this be our species vector: v = [H2 H Br2 Br HBr]^T
</p>

<p>
the reactions are then defined by M*v where M is a stoichometric matrix in which each row represents a reaction with negative stoichiometric coefficients for reactants, and positive stoichiometric coefficients for products. A stoichiometric coefficient of 0 is used for species not participating in the reaction.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

<span style="color: #ff0000; font-weight: bold;">#    </span><span style="color: #ff0000; font-weight: bold;">[H2  H Br2 Br HBr]</span>
M = [[-1,  0, -1,  0,  2],  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">H2 + Br2 == 2HBR</span>
     [ 0,  0, -1,  2,  0],  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Br2 == 2Br</span>
     [-1,  1,  0, -1,  1],  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Br + H2 == HBr + H</span>
     [ 0, -1, -1,  1,  1],  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">H + Br2 == HBr + Br</span>
     [ 1, -1,  0,  1,  -1], <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">H + HBr == H2 + Br</span>
     [ 0,  0,  1, -2,  0]]  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">2Br == Br2</span>

U, s, V = np.linalg.svd(M)
<span style="color: #8b0000;">print</span> s
<span style="color: #8b0000;">print</span> np.sum(np.abs(s) &gt; 1e-15)
</pre>
</div>

<pre class="example">
[  3.84742803e+00   3.32555975e+00   1.46217301e+00   2.04165560e-16
   4.75081557e-17]
3
</pre>

<p>
6 reactions are given, but the rank of the matrix is only 3. so there
are only four independent reactions. You can see that reaction 6 is just
the opposite of reaction 2, so it is clearly not independent. Also,
reactions 3 and 5 are just the reverse of each other, so one of them can
also be eliminated. finally, reaction 4 is equal to reaction 1 minus
reaction 3.
</p>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/03/01/Determining-linear-independence-of-a-set-of-vectors.org">org-mode source</a><p>